STMicroelectronics/STM32CubeMP2/Drivers/STM32MP2xx_HAL_Driver/Inc/stm32mp2xx-ddr4-1x32Gbits-1x16bits-800MHz.h
/*
 * STM32MP21 DDR4 board configuration
 * DDR4 1x32Gbits 1x16bits 800MHz
 *
 * version       3
 * package       2
 * memclk        800MHz   (2x DFI clock)
 * speed_bin     Worse    from JEDEC
 * device_width  8        twin-die
 * width         16       32: full width / 16: half width
 * density       16Gbits  (per device)
 * Addressing    RBC      row/bank interleaving
 * RDBI          No       Read DBI
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
 */

#ifndef STM32MP2XX_DDR4_1x32GBITS_1x16BITS_800MHZ_H
#define STM32MP2XX_DDR4_1x32GBITS_1x16BITS_800MHZ_H

#define DDR_MEM_NAME  "DDR4 1x32Gbits 1x16bits 800MHz"
#define DDR_MEM_SPEED 800000U
#define DDR_MEM_SIZE  0x100000000UL

#define DDR_MSTR 0x01040010U
#define DDR_MRCTRL0 0x00000030U
#define DDR_MRCTRL1 0x00000000U
#define DDR_MRCTRL2 0x00000000U
#define DDR_DERATEEN 0x00000000U
#define DDR_DERATEINT 0x00000000U
#define DDR_DERATECTL 0x00000000U
#define DDR_PWRCTL 0x00000000U
#define DDR_PWRTMG 0x000D0001U
#define DDR_HWLPCTL 0x00000002U
#define DDR_RFSHCTL0 0x00210010U
#define DDR_RFSHCTL1 0x00000000U
#define DDR_RFSHCTL3 0x00000000U
#define DDR_RFSHTMG 0x006100DCU
#define DDR_RFSHTMG1 0x008C0000U
#define DDR_CRCPARCTL0 0x00000000U
#define DDR_CRCPARCTL1 0x00001000U
#define DDR_INIT0 0xC0020002U
#define DDR_INIT1 0x00010002U
#define DDR_INIT2 0x00000D00U
#define DDR_INIT3 0x03140103U
#define DDR_INIT4 0x00000000U
#define DDR_INIT5 0x00100004U
#define DDR_INIT6 0x00080460U
#define DDR_INIT7 0x00000416U
#define DDR_DIMMCTL 0x00000000U
#define DDR_RANKCTL 0x0000066FU
#define DDR_RANKCTL1 0x0000000AU
#define DDR_DRAMTMG0 0x0D0E1A0EU
#define DDR_DRAMTMG1 0x00030314U
#define DDR_DRAMTMG2 0x0506050AU
#define DDR_DRAMTMG3 0x0050400CU
#define DDR_DRAMTMG4 0x06030307U
#define DDR_DRAMTMG5 0x04040302U
#define DDR_DRAMTMG6 0x02020005U
#define DDR_DRAMTMG7 0x00000202U
#define DDR_DRAMTMG8 0x04040A07U
#define DDR_DRAMTMG9 0x00020308U
#define DDR_DRAMTMG10 0x001C180AU
#define DDR_DRAMTMG11 0x4405021CU
#define DDR_DRAMTMG12 0x0C020010U
#define DDR_DRAMTMG13 0x1C200004U
#define DDR_DRAMTMG14 0x000000A0U
#define DDR_DRAMTMG15 0x00000000U
#define DDR_ZQCTL0 0x01000040U
#define DDR_ZQCTL1 0x200030D4U
#define DDR_ZQCTL2 0x00000000U
#define DDR_DFITMG0 0x03898206U
#define DDR_DFITMG1 0x00080303U
#define DDR_DFILPCFG0 0x07004111U
#define DDR_DFILPCFG1 0x00000000U
#define DDR_DFIUPD0 0xC0300018U
#define DDR_DFIUPD1 0x005700B4U
#define DDR_DFIUPD2 0x80000000U
#define DDR_DFIMISC 0x00000041U
#define DDR_DFITMG2 0x00000906U
#define DDR_DFITMG3 0x00000000U
#define DDR_DBICTL 0x00000001U
#define DDR_DFIPHYMSTR 0x80000000U
#define DDR_ADDRMAP0 0x0000001FU
#define DDR_ADDRMAP1 0x003F0A0AU
#define DDR_ADDRMAP2 0x00000700U
#define DDR_ADDRMAP3 0x00000000U
#define DDR_ADDRMAP4 0x00001F1FU
#define DDR_ADDRMAP5 0x080F0808U
#define DDR_ADDRMAP6 0x08080808U
#define DDR_ADDRMAP7 0x00000F08U
#define DDR_ADDRMAP8 0x00000801U
#define DDR_ADDRMAP9 0x08080808U
#define DDR_ADDRMAP10 0x08080808U
#define DDR_ADDRMAP11 0x00000008U
#define DDR_ODTCFG 0x0600060CU
#define DDR_ODTMAP 0x00000001U
#define DDR_SCHED 0x80001B00U
#define DDR_SCHED1 0x00000000U
#define DDR_PERFHPR1 0x04000200U
#define DDR_PERFLPR1 0x08000080U
#define DDR_PERFWR1 0x08000400U
#define DDR_SCHED3 0x04040208U
#define DDR_SCHED4 0x08400810U
#define DDR_DBG0 0x00000000U
#define DDR_DBG1 0x00000000U
#define DDR_DBGCMD 0x00000000U
#define DDR_SWCTL 0x00000000U
#define DDR_SWCTLSTATIC 0x00000000U
#define DDR_POISONCFG 0x00000000U
#define DDR_PCCFG 0x00000000U
#define DDR_PCFGR_0 0x00704100U
#define DDR_PCFGW_0 0x00004100U
#define DDR_PCTRL_0 0x00000000U
#define DDR_PCFGQOS0_0 0x0021000CU
#define DDR_PCFGQOS1_0 0x01000080U
#define DDR_PCFGWQOS0_0 0x01100C07U
#define DDR_PCFGWQOS1_0 0x04000200U
#define DDR_PCFGR_1 0x00704100U
#define DDR_PCFGW_1 0x00004100U
#define DDR_PCTRL_1 0x00000000U
#define DDR_PCFGQOS0_1 0x00100007U
#define DDR_PCFGQOS1_1 0x01000080U
#define DDR_PCFGWQOS0_1 0x01100C07U
#define DDR_PCFGWQOS1_1 0x04000200U

#define DDR_UIB_DRAMTYPE 0x00000000
#define DDR_UIB_DIMMTYPE 0x00000004
#define DDR_UIB_LP4XMODE 0x00000000
#define DDR_UIB_NUMDBYTE 0x00000002
#define DDR_UIB_NUMACTIVEDBYTEDFI0 0x00000002
#define DDR_UIB_NUMACTIVEDBYTEDFI1 0x00000000
#define DDR_UIB_NUMANIB 0x00000008
#define DDR_UIB_NUMRANK_DFI0 0x00000001
#define DDR_UIB_NUMRANK_DFI1 0x00000000
#define DDR_UIB_DRAMDATAWIDTH 0x00000010
#define DDR_UIB_NUMPSTATES 0x00000001
#define DDR_UIB_FREQUENCY_0 0x00000320
#define DDR_UIB_PLLBYPASS_0 0x00000000
#define DDR_UIB_DFIFREQRATIO_0 0x00000001
#define DDR_UIB_DFI1EXISTS 0x00000000
#define DDR_UIB_TRAIN2D 0x00000000
#define DDR_UIB_HARDMACROVER 0x00000003
#define DDR_UIB_READDBIENABLE_0 0x00000000
#define DDR_UIB_DFIMODE 0x00000000

#define DDR_UIA_LP4RXPREAMBLEMODE_0 0x00000000
#define DDR_UIA_LP4POSTAMBLEEXT_0 0x00000000
#define DDR_UIA_D4RXPREAMBLELENGTH_0 0x00000000
#define DDR_UIA_D4TXPREAMBLELENGTH_0 0x00000000
#define DDR_UIA_EXTCALRESVAL 0x00000000
#define DDR_UIA_IS2TTIMING_0 0x00000000
#define DDR_UIA_ODTIMPEDANCE_0 0x00000035
#define DDR_UIA_TXIMPEDANCE_0 0x00000028
#define DDR_UIA_ATXIMPEDANCE 0x00000028
#define DDR_UIA_MEMALERTEN 0x00000000
#define DDR_UIA_MEMALERTPUIMP 0x00000000
#define DDR_UIA_MEMALERTVREFLEVEL 0x00000000
#define DDR_UIA_MEMALERTSYNCBYPASS 0x00000000
#define DDR_UIA_DISDYNADRTRI_0 0x00000001
#define DDR_UIA_PHYMSTRTRAININTERVAL_0 0x00000000
#define DDR_UIA_PHYMSTRMAXREQTOACK_0 0x00000000
#define DDR_UIA_WDQSEXT 0x00000000
#define DDR_UIA_CALINTERVAL 0x00000009
#define DDR_UIA_CALONCE 0x00000000
#define DDR_UIA_LP4RL_0 0x00000000
#define DDR_UIA_LP4WL_0 0x00000000
#define DDR_UIA_LP4WLS_0 0x00000000
#define DDR_UIA_LP4DBIRD_0 0x00000000
#define DDR_UIA_LP4DBIWR_0 0x00000000
#define DDR_UIA_LP4NWR_0 0x00000000
#define DDR_UIA_LP4LOWPOWERDRV 0x00000000
#define DDR_UIA_DRAMBYTESWAP 0x00000000
#define DDR_UIA_RXENBACKOFF 0x00000000
#define DDR_UIA_TRAINSEQUENCECTRL 0x00000000
#define DDR_UIA_SNPSUMCTLOPT 0x00000000
#define DDR_UIA_SNPSUMCTLF0RC5X_0 0x00000000
#define DDR_UIA_TXSLEWRISEDQ_0 0x0000000F
#define DDR_UIA_TXSLEWFALLDQ_0 0x0000000F
#define DDR_UIA_TXSLEWRISEAC 0x0000000F
#define DDR_UIA_TXSLEWFALLAC 0x0000000F
#define DDR_UIA_DISABLERETRAINING 0x00000001
#define DDR_UIA_DISABLEPHYUPDATE 0x00000000
#define DDR_UIA_ENABLEHIGHCLKSKEWFIX 0x00000000
#define DDR_UIA_DISABLEUNUSEDADDRLNS 0x00000001
#define DDR_UIA_PHYINITSEQUENCENUM 0x00000000
#define DDR_UIA_ENABLEDFICSPOLARITYFIX 0x00000000
#define DDR_UIA_PHYVREF 0x0000005E
#define DDR_UIA_SEQUENCECTRL_0 0x0000031F

#define DDR_UIM_MR0_0 0x00000314
#define DDR_UIM_MR1_0 0x00000103
#define DDR_UIM_MR2_0 0x00000000
#define DDR_UIM_MR3_0 0x00000000
#define DDR_UIM_MR4_0 0x00000008
#define DDR_UIM_MR5_0 0x00000460
#define DDR_UIM_MR6_0 0x00000416
#define DDR_UIM_MR11_0 0x00000000
#define DDR_UIM_MR12_0 0x00000000
#define DDR_UIM_MR13_0 0x00000000
#define DDR_UIM_MR14_0 0x00000000
#define DDR_UIM_MR22_0 0x00000000

#define DDR_UIS_SWIZZLE_0 0x00000018
#define DDR_UIS_SWIZZLE_1 0x00000005
#define DDR_UIS_SWIZZLE_2 0x0000000B
#define DDR_UIS_SWIZZLE_3 0x00000012
#define DDR_UIS_SWIZZLE_4 0x0000000D
#define DDR_UIS_SWIZZLE_5 0x00000003
#define DDR_UIS_SWIZZLE_6 0x00000019
#define DDR_UIS_SWIZZLE_7 0x00000016
#define DDR_UIS_SWIZZLE_8 0x0000000E
#define DDR_UIS_SWIZZLE_9 0x00000007
#define DDR_UIS_SWIZZLE_10 0x00000017
#define DDR_UIS_SWIZZLE_11 0x00000013
#define DDR_UIS_SWIZZLE_12 0x0000001A
#define DDR_UIS_SWIZZLE_13 0x00000009
#define DDR_UIS_SWIZZLE_14 0x00000000
#define DDR_UIS_SWIZZLE_15 0x00000000
#define DDR_UIS_SWIZZLE_16 0x00000000
#define DDR_UIS_SWIZZLE_17 0x00000002
#define DDR_UIS_SWIZZLE_18 0x0000000C
#define DDR_UIS_SWIZZLE_19 0x00000001
#define DDR_UIS_SWIZZLE_20 0x00000000
#define DDR_UIS_SWIZZLE_21 0x0000000A
#define DDR_UIS_SWIZZLE_22 0x00000004
#define DDR_UIS_SWIZZLE_23 0x00000014
#define DDR_UIS_SWIZZLE_24 0x00000008
#define DDR_UIS_SWIZZLE_25 0x00000006
#define DDR_UIS_SWIZZLE_26 0x120B0518
#define DDR_UIS_SWIZZLE_27 0x1619030D
#define DDR_UIS_SWIZZLE_28 0x1317070E
#define DDR_UIS_SWIZZLE_29 0x0000091A
#define DDR_UIS_SWIZZLE_30 0x00010C02
#define DDR_UIS_SWIZZLE_31 0x0814040A
#define DDR_UIS_SWIZZLE_32 0x00000006
#define DDR_UIS_SWIZZLE_33 0x00000000
#define DDR_UIS_SWIZZLE_34 0x00000000
#define DDR_UIS_SWIZZLE_35 0x00000000
#define DDR_UIS_SWIZZLE_36 0x00000000
#define DDR_UIS_SWIZZLE_37 0x00000000
#define DDR_UIS_SWIZZLE_38 0x00000000
#define DDR_UIS_SWIZZLE_39 0x00000000
#define DDR_UIS_SWIZZLE_40 0x00000000
#define DDR_UIS_SWIZZLE_41 0x00000000
#define DDR_UIS_SWIZZLE_42 0x00000000
#define DDR_UIS_SWIZZLE_43 0x00000000

#define DDR_PLL_SOURCE RCC_PLLSOURCE_HSE
#define DDR_PLL_MODE 0U
#define DDR_PLL_FBDIV 20U
#define DDR_PLL_FREFDIV 1U
#define DDR_PLL_FRACIN 0U
#define DDR_PLL_POSTDIV1 1U
#define DDR_PLL_POSTDIV2 2U
#define DDR_PLL_STATE RCC_PLL_ON
#define DDR_PLL_SSM_MODE RCC_PLL_CENTERSPREAD
#define DDR_PLL_SSM_SPREAD 0U
#define DDR_PLL_SSM_DIVVAL 0U

#endif /* STM32MP2XX_DDR4_1x32GBITS_1x16BITS_800MHZ_H */
